Tests/CordicXML/CancelRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAPENV:Envelope 
xmlns:SOAPENV="http://www.w3.org/2003/05/soap-envelope" 
xmlns:SOAPENC="http://www.w3.org/2003/05/soap-encoding" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <SOAPENV:Body>
    <CancelRequest xmlns="http://www.cordicgateway.com/cni">
      <SourceSystem>CABFIND</SourceSystem>
      <SourcePassword>Charioteer55</SourcePassword>
      <SourceJobID></SourceJobID>
      <CancelReason></CancelReason>
    </CancelRequest>
  </SOAPENV:Body>
</SOAPENV:Envelope>
